MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C31B0AGP20000/mcu.h
typedef struct stc_exti_nmirr_field
{
        __IO  uint16_t  NR                       :1;
        __IO  uint16_t  RESERVED0                :15;
} stc_exti_nmirr_field_t;

typedef struct stc_exti_nmicl_field
{
        __IO  uint16_t  NCL                      :1;
        __IO  uint16_t  RESERVED0                :15;
} stc_exti_nmicl_field_t;

typedef struct stc_exti_elvr2_field
{
        __IO  uint32_t  LC0                      :1;
        __IO  uint32_t  LC1                      :1;
        __IO  uint32_t  LC2                      :1;
        __IO  uint32_t  LC3                      :1;
        __IO  uint32_t  LC4                      :1;
        __IO  uint32_t  LC5                      :1;
        __IO  uint32_t  LC6                      :1;
        __IO  uint32_t  LC7                      :1;
        __IO  uint32_t  LC8                      :1;
        __IO  uint32_t  LC9                      :1;
        __IO  uint32_t  LC10                     :1;
        __IO  uint32_t  LC11                     :1;
        __IO  uint32_t  LC12                     :1;
        __IO  uint32_t  LC13                     :1;
        __IO  uint32_t  LC14                     :1;
        __IO  uint32_t  LC15                     :1;
        __IO  uint32_t  LC16                     :1;
        __IO  uint32_t  LC17                     :1;
        __IO  uint32_t  LC18                     :1;
        __IO  uint32_t  LC19                     :1;
        __IO  uint32_t  LC20                     :1;
        __IO  uint32_t  LC21                     :1;
        __IO  uint32_t  LC22                     :1;
        __IO  uint32_t  LC23                     :1;
        __IO  uint32_t  LC24                     :1;
        __IO  uint32_t  LC25                     :1;
        __IO  uint32_t  LC26                     :1;
        __IO  uint32_t  LC27                     :1;
        __IO  uint32_t  LC28                     :1;
        __IO  uint32_t  LC29                     :1;
        __IO  uint32_t  LC30                     :1;
        __IO  uint32_t  LC31                     :1;
} stc_exti_elvr2_field_t;

typedef struct stc_exti_nmienr_field
{
        __IO   uint8_t  NE0                      :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_exti_nmienr_field_t;

/*******************************************************************************
* FASTIO_MODULE
*******************************************************************************/
typedef struct stc_fastio_fpdir0_field
{
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED1                :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED2                :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  RESERVED3                :9;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED4                :16;
} stc_fastio_fpdir0_field_t;

typedef struct stc_fastio_fpdir1_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED0                :28;
} stc_fastio_fpdir1_field_t;

typedef struct stc_fastio_fpdir2_field
{
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED1                :28;
} stc_fastio_fpdir2_field_t;

typedef struct stc_fastio_fpdir3_field
{
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED1                :28;
} stc_fastio_fpdir3_field_t;

typedef struct stc_fastio_fpdir4_field
{
        __IO  uint32_t  RESERVED0                :6;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  RESERVED1                :24;
} stc_fastio_fpdir4_field_t;

typedef struct stc_fastio_fpdir5_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_fastio_fpdir5_field_t;

typedef struct stc_fastio_fpdir6_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_fastio_fpdir6_field_t;

typedef struct stc_fastio_fpdir8_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_fastio_fpdir8_field_t;

typedef struct stc_fastio_fpdire_field
{
        __IO  uint32_t  RESERVED0                :2;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED1                :28;
} stc_fastio_fpdire_field_t;

typedef struct stc_fastio_fpdor0_field
{
        __IO  uint32_t  RESERVED0                :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  RESERVED1                :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED2                :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  RESERVED3                :9;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED4                :16;
} stc_fastio_fpdor0_field_t;

typedef struct stc_fastio_fpdor1_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  RESERVED0                :28;
} stc_fastio_fpdor1_field_t;

