MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C31B0AGP20000/mcu.h
/*******************************************************************************
* INTREQ_MODULE
*******************************************************************************/
typedef struct stc_intreq_oddpks_field
{
        __IO   uint8_t  ODDPKS0                  :1;
        __IO   uint8_t  ODDPKS1                  :1;
        __IO   uint8_t  ODDPKS2                  :1;
        __IO   uint8_t  ODDPKS3                  :1;
        __IO   uint8_t  ODDPKS4                  :1;
        __IO   uint8_t  RESERVED0                :3;
} stc_intreq_oddpks_field_t;

typedef struct stc_intreq_exc02mon_field
{
        __IO  uint32_t  NMI                      :1;
        __IO  uint32_t  HWINT                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_intreq_exc02mon_field_t;

typedef struct stc_intreq_irq00mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq00mon_field_t;

typedef struct stc_intreq_irq01mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq01mon_field_t;

typedef struct stc_intreq_irq02mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq02mon_field_t;

typedef struct stc_intreq_irq03mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq03mon_field_t;

typedef struct stc_intreq_irq04mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq04mon_field_t;

typedef struct stc_intreq_irq05mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq05mon_field_t;

typedef struct stc_intreq_irq06mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq06mon_field_t;

typedef struct stc_intreq_irq07mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq07mon_field_t;

typedef struct stc_intreq_irq08mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq08mon_field_t;

typedef struct stc_intreq_irq09mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq09mon_field_t;

typedef struct stc_intreq_irq10mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq10mon_field_t;

typedef struct stc_intreq_irq11mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq11mon_field_t;

typedef struct stc_intreq_irq12mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq12mon_field_t;

typedef struct stc_intreq_irq13mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq13mon_field_t;

typedef struct stc_intreq_irq14mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq14mon_field_t;

typedef struct stc_intreq_irq15mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq15mon_field_t;

typedef struct stc_intreq_irq16mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq16mon_field_t;

typedef struct stc_intreq_irq17mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq17mon_field_t;

typedef struct stc_intreq_irq18mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq18mon_field_t;

typedef struct stc_intreq_irq19mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq19mon_field_t;

typedef struct stc_intreq_irq20mon_field
{
        __IO  uint32_t  INT0                     :1;
        __IO  uint32_t  INT1                     :1;
        __IO  uint32_t  INT2                     :1;
        __IO  uint32_t  RESERVED0                :29;
} stc_intreq_irq20mon_field_t;

